const quotes = [
  {
    quote: "오늘날 개발자들은 필요 이상으로 많지만, 좋은 개발자는 부족하다.",
    author: "피트 맥브린",
  },
  {
    quote:
      "프로그래머가 되고자 준비하는 가장 좋은 방법은 프로그램을 짜는 것이며, 다른 사람들이 작성한 뛰어난 프로그램을 공부하는 것이다. 나 같은 경우에는 컴퓨터 과학 센터의 쓰레기장에 가서 버러진 운영체제 코드 리스팅을 건지곤 했다.",
    author: "빌 게이츠",
  },
  {
    quote:
      "어떤 일이든 간에 사랑하지 앟고서는 정말로 잘 할 수가 없다. 그리고 당신이 해킹을 사랑한다면 필연적으로 자신만의 프로젝트를 하게 될 것이다.",
    author: "폴 그레이엄",
  },
  {
    quote:
      "인위적인 제한에 걸려 있을 때, 우리는 자신의 능력을 한계까지 밀어붙이는 ‘장난감’프로그램을 만듦으로써 종종 효험을 볼 수 있다.",
    author: "도널드 커누스",
  },
  {
    quote:
      "우리가 마스터라고 알고 있는 사람들은 어떤 특정한 기술에 더 능숙해질 목적으로 거기 전념하지는 않는다. 사실 그 사람들은 연습하는 것 자체를 좋아하며, 이 때문에 그들이 점점 더 능숙해지는 것이다. 그리고 더 능숙해질수록 기본적인 동작을 더 즐기게 되는 선순환이 완성된다.",
    author: "조지 레너드",
  },
  {
    quote:
      "모르는 것을 배우는 일이, 어떻게 하는지 이미 아는 일을 행하는 것보다 더 중요할 때가 흔히 있다.",
    author: "짐 하이스미스",
  },
  {
    quote:
      "장인적인 전통에서, 새내기는 마스터의 견습생으로 시작한다. 그들은 쉬운 일을 거드는 것부터 시작하고 숙달되어가면서 점차로 더 크고 복잡한 작업으로 올라간다.",
    author: "피트 맥브린",
  },
  {
    quote:
      "무참한 실패를 맛본 적이 한 번도 없다면, 당신은 뭔가 가치 있는 일을 시도했떤 적이 한 번도 없다고 봐야한다.",
    author: "크리스토퍼 호킨스",
  },
  {
    quote:
      "만일 우리가 독립성을 가치 있게 여긴다면, 현재 체제의 지식, 가치, 사고방식에 내 생각을 맞추려는 경향이 점점 늘어가는 것이 불안하다면, 우리는 자신의 유일함에 대해, 스스로 방향을 잡아가는 법에 대해, 자발적을 ㅗ학습하는 법에 대해 배울 수 있는 호나경을 조성하고자 할 것이다.",
    author: "칼 로저스",
  },
  {
    quote:
      "장인들은 소프트웨어 개발이라는 기예를 기꺼이 배우고자 하는 열성적인 견습생만 채용한다. (중략) 견습생들은 소프트웨어 장인정신 개념에서 필수적인 부분이다. 그들은 일에 대한 의욕과 배움에 대한 추진력을 가지고 와서는 다른 모든 이들에게 퍼뜨리기 때문이다.",
    author: "피트 맥브린",
  },
];

const quote = document.querySelector("#quote span:first-child");
const author = document.querySelector("#quote span:last-child");

const todaysQuote = quotes[Math.floor(Math.random() * quotes.length)];

quote.innerText = todaysQuote.quote;
author.innerText = todaysQuote.author;
